# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# Binaries
brew "ack"
brew "aria2"
brew "aspell"
brew "bash"
brew "boost"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "eza"
brew "ffmpeg"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "graphviz"
brew "grep"
brew "htop"
brew "languagetool"
brew "libusb"
brew "llvm"
brew "llvm@16"
brew "ltex-ls"
brew "mas"
brew "neovim"
brew "ninja"
brew "openssh"
brew "osx-cross/arm/arm-none-eabi-gcc@9", link: true
brew "osx-cross/avr/avr-gcc@12", link: true
brew "perl"
brew "pipenv"
brew "postgresql@16"
brew "qmk/qmk/qmk"
brew "ripgrep"
brew "rust"
brew "scrcpy"
brew "texlab"
brew "the_silver_searcher"
brew "wget"
brew "xz"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zstd"

# Casks
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anydesk"
cask "appcleaner"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "iterm2"
cask "keepassxc"
cask "keepingyouawake"
cask "linearmouse"
cask "logitech-g-hub"
cask "macs-fan-control"
cask "mactex-no-gui"
cask "nextcloud"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "openconnect-gui"
cask "pocket-casts"
cask "presentation"
cask "qmk-toolbox"
cask "skim"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "threema"
cask "tiles"
cask "tiny-player"
cask "vial"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "xact"
cask "xld"
cask "zoom"

# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-firamono-nerd-font-mono"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"

# Screensaver
cask "brooklyn"

# Mac App Store
mas "Xcode", id: 497799835
