# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "beeftornado/rmtree"
tap "cliutils/apple"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "ack"
brew "apache-spark"
brew "openssl"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bazel"
brew "boost"
brew "readline"
brew "python"
brew "cmake"
brew "coreutils"
brew "exa"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "gnu-sed"
brew "libtool"
brew "graphviz"
brew "htop"
brew "inetutils"
brew "libomp"
brew "libyaml"
brew "swig"
brew "llvm"
brew "luajit"
brew "mackup"
brew "mas"
brew "mysql-client"
brew "neo4j"
brew "neovim"
brew "ninja"
brew "node"
brew "pkg-config"
brew "postgresql"
brew "python@2"
brew "ruby"
brew "scrcpy"
brew "screenfetch"
brew "sphinx-doc"
brew "stubby", restart_service: true
brew "tree"
brew "wakeonlan"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zsh"

# Apps
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "atom"
cask "azure-data-studio"
cask "calibre"
cask "coconutbattery"
cask "commander-one"
cask "discord"
cask "docker"
cask "dropbox"
cask "fanny"
cask "firefox"
cask "gitkraken"
cask "google-chrome-beta"
cask "hstracker"
cask "iina"
cask "iterm2"
cask "java"
cask "java8"
cask "jdownloader"
cask "keepassxc"
cask "keepingyouawake"
cask "mactex"
cask "mkvtoolnix"
cask "mtmr"
cask "owncloud"
cask "pocket-casts"
cask "presentation"
cask "rocket-chat"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "teamviewer"
cask "telegram"
cask "texpad"
cask "the-unarchiver"
cask "tiny-player"
cask "track-o-bot"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"

# Screensaver
cask "aerial"
cask "brooklyn"

# Mac App Store
mas 'Magnet', id: 441258766
mas 'NZBVortex3', id: 914250185
mas 'Display-Menu', id: 549083868
mas 'Lungo', id: 1263070803
