# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# Binaries
brew "ack"
brew "aria2"
brew "aspell"
brew "bash"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "dnscrypt-proxy", restart_service: true
brew "doxygen"
brew "exa"
brew "exiftool"
brew "ffmpeg"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "languagetool"
brew "libusb"
brew "mas"
brew "neovim"
brew "ninja"
brew "node"
brew "ocrmypdf"
brew "openssh"
brew "osx-cross/avr/avr-gcc@11", link: true
brew "pdftk-java"
brew "poppler"
brew "python@3.10"
brew "qmk/qmk/qmk"
brew "rust"
brew "scrcpy"
brew "subversion"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "xz"
brew "yt-dlp"
brew "zsh"
brew "zstd"

# Casks
cask "adobe-acrobat-reader"
cask "adoptopenjdk8"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anydesk"
cask "appcleaner"
cask "calibre"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "iterm2"
cask "jdownloader"
cask "keepassxc"
cask "keepingyouawake"
cask "logitech-g-hub"
cask "macs-fan-control"
cask "mactex"
cask "mark-text"
cask "mkvtoolnix"
cask "nextcloud"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "openconnect-gui"
cask "pocket-casts"
cask "presentation"
cask "qmk-toolbox"
cask "skim"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "threema"
cask "tiles"
cask "tiny-player"
cask "vagrant"
cask "via"
cask "vial"
cask "virtualbox"
cask "vlc"
cask "waterfox"
cask "xact"
cask "xld"
cask "zoom"

# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-firamono-nerd-font-mono"
cask "font-meslo-for-powerline"
cask "font-meslo-lg"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"

# Screensaver
cask "aerial"
cask "brooklyn"

# Mac App Store
mas 'Xcode', id: 497799835
